Repository: RandAlMuhanna/FALCON
Catalog: FalconApplication/*.lproj/Localizable.strings
Languages: ar

source: Weather
ar: الطقس

source: Seasons
ar: المواسم

source: Search for a city
ar: ابحث عن مدينة

source: AL Murba’aniah
ar: المربعانية

source: AL Shubt
ar: الشبط

source: AL Aqareb
ar: العقارب

source: AL Hamemeen
ar: الحميمين

source: AL Thera’aien
ar: الذراعين

source: AL-Thuraya
ar: الثريا

source: AL-Tuwaiba’a
ar: التويبع

source: AL-Jawzaa
ar: الجوزاء

source: AL-Marzam
ar: المرزم

source: AL-Khoulaibeen
ar: الكليبين

source: Suhail
ar: سهيل

source: AL-Wasem
ar: الوسم

source: (December 7th - January 14th)
ar: ٧ ديسمبر - ١٤ يناير

source: (January 15th - February 9th)
ar: ١٥ يناير - ٩ فبراير

source: (February 10th - March 20th)
ar: ١٠ فبراير - ٢٠ مارس

source: (March 21st - April 15th)
ar: ٢١ مارس - ١٥ أبريل

source: (April 16th - May 11th)
ar: ١٦ أبريل - ١١ مايو

source: (May 12th - June 19th)
ar: ١٢ مايو - ١٩ يونيو

source: (June 20 - July 2nd)
ar: ٢٠ يونيو - ٢ يوليو

source: (July 3rd - July 28)
ar: ٣ يوليو - ٢٨ يوليو

source: (July 29th - August 10th)
ar: ٢٩ يوليو - ١٠ اغسطس

source: (August 11th - August 23rd)
ar: ١١ اغسطس - ٢٣ اغسطس

source: (August 24th - October 15th)
ar: ٢٤ أغسطس - ١٥ أكتوبر

source: (October 16th - December 6th)
ar: ١٦ أكتوبر - ٦ ديسمبر

source: • At the beginning of Almurbaaniah It gets cold.
ar: • يشتد البرد في أوله

source: • It gets colder and fog forms in the morning.
ar: • يشتد البرد فيه ويتكوّن الضباب في النهار

source: • End of winter, winds are strong and the rains are frequent.
ar: • نهاية الشتاء ، تشتد فيه الرياح و تكثر الأمطار

source: • It's getting warmer, the trees are greener, and insects are out from their lairs.
ar: • يزداد الدفء ، تخضر الأشجار وتخرج الحشرات من مخابئها

source: • The weather is mild at night and tends to be hot at noon.
ar: • يعتدل الجو في الليل ويميل للحرارة في الظهيرة

source: • The weather tends to be hot.
ar: • يميل الجو إلى الحرارة

source: • It has the longest day and the shortest night.
ar: • أطول نهار بين أيام السنة، وأقصر ساعات في الليل

source: • The heat increase and the toxins and sandstorms abound.
ar: • يشتد الحر وتكثر السموم والعواصف الرملية

source: • Nice weather in the evening.
ar: • يكون الجو لطيف في المساء

source: • The night is getting colder and it is still hot during the day.
ar: • الجو حار نهاراً ، معتدل ليلاً

source: • The weather is mild during the day and cool at night.
ar: • الجو معتدل نهاراً ، بارد ليلاً

source: • Wheat and barley are grown in the north of the kingdom.
ar: • يزرع القمح والشعير في شمال المملكة

source: • Nothing is planted in it due to its coldness.
ar: • لايزرع فيه شيء لشدة برودته

source: • Peach, pomegranate, apricot and almond leaves
ar: • يورق فيه الخوخ والرمان والمشمش واللوز

source: • Rice is grown and wheat is harvested.
ar: • يزرع فيه الأرز ويحصد القمح

source: • It is advisable to pollinate palm trees.
ar: • يستحسن فيه تلقيح النخيل

source: • Corn and peanuts are grown in it
ar: • تزرع فيه الذرة و الفول السوداني

source: • Zucchini, parsley, and watercress are grown in it.
ar: • يزرع فيه الكوسة والبقدونس والجرجير

source: • Pumpkins, zucchini and cucumbers are grown in it
ar: • يزرع فيه القرع والكوسة والخيار

source: • There are plenty of dates and summer fruits.
ar: • يكثر فيه الرطب والفواكة الصيفية

source: • Fall planting begins.
ar: • تبدأ الزراعة الخريفية المبكرة

source: • Winter vegetables are sown
ar: • تزرع الخضروات الشتوية

source: • Truffles and wild herbs are grown
ar: • ينبت الفقع والنفل والأعشاب البرية

source: Wind
ar: الرياح

source: Rain
ar: المطر

source: Humidity
ar: الرطوبة

source: Feels Like
ar: تشعر به
